
class DashBoardRules:
    title = 'Правила'
    description = """**Чтобы получать информацию определённой организации, нажмите на один из пунктов.**

📗 **Правила Сервера** - Пункт в котором прописаны основные правила проекта PoopLand.

📘 **Информация Сервер** – Пункт, где вы можете увидеть полезные команды.

<:5464discordnew:1081895368620519495> **Правила Discord** - Пункт, в котором вы можете посмотреть правила Discord сервера Poop Land.

🏭 **Правила Ферм** – Пункт, в котором прописаны правила связанные с фермами.

🔥 **Правила Нижнего Мира** - Пункт, в котором описаны правила измерения ада и штрафы, которые вам могут выдать за нарушения.

🧑🏿‍🦽  Правила МинЗдрава - Пункт, в котором прописаны основные правила ну блять очевидно МинЗдрава.

🏙️ **Правила Территорий** - Пункт, в котором расписаны правила запреток и черных списков

💵 **Штрафы PoopLand** - Пункт, в котором прописаны все штрафы cтраны PoopLand

🌄 **Правила Спавна** - Пункт, в котором прописаны цены за различные рекламные интеграции на территории спавна

🔮 **Правила Энда** - Пункт, в котором прописаны правила измерения энда.

☠️ **Баны** - Пункт, в котором прописаны причины бана и наказания, которые вы получите 

🛒 **Правила Торговли** - Пункт, в котором описаны основные правила торговли PoopLand"""

class ServerTechRules:
    title = 'Общие положения'
    description = """**1.1.** Запрещено искать и использовать лазейки в правилах. Незнание правил не освобождает вас от ответственности! Спорные ситуации не прописанные в правилах решает **Администрация сервера**.
Все правила действуют в Minecraft и распространяются на государственные дискорд сервера.
**1.1.1.** На сервере в Майнкрафте, в официальном дискорде и других государственных дискордах запрещено провоцировать конфликты на национальной/расовой почве. После поступления жалобы из-за провокации такого конфликта нарушителю будет выдано первое предупреждение. При поступлении повторной жалобы будет выдан штраф в размере 256 ар. После третьей жалобы нарушитель будет забанен. В некоторых случаях после первой жалобы может последовать штраф либо даже бан.
**1.2.** За любое проявление токсичного поведения по отношению к игрокам, городам, а также всему проекту в целом будет выдан штраф в размере 128 ар. За повторное нарушение x2.
**1.3.** Запрещено распространение **конфиденциальной** информации о игроках сервера без их разрешения.(Наказание определяет суд)
**1.4.** Запрещено использование читерских модификаций, ресурспаков, стороннего софта, мультиаккаунтов и прочих способов получения преимущества над другими игроками. Включает в себя ботов, автокликеры, мини-карты с отображением игроков и мобов, X-Ray, афк-рыбалку, использование багов игры, дюпы (включая коврики и рельсы) и другие жульнические методы.
За пособничество игрокам и сокрытие информации вы будете подвержены суду со стороны Администрации.
**1.5.** Запрещено присвоение ников\скинов, а также их использование без разрешения владельца.
**1.6.** Запрещено намеренно занижать цены и нарушать экономику сервера.
Суд будет определять нарушает ли экономику данный игрок.
**1.7.** Минимальная цена на книгу с зачарованием «Починка» - 20 алмазной руды (20 ар.)."""

class ServerGameRules:
    title = 'Игровой процесс'
    description = """**2.1.** Запрещен самосуд, присвоение чужой территории без договоренности.
**2.2** Запрещено намеренное разрушение чужих построек, воровство чужого имущества.
(приблизительно **600** предметов и более является грифом и игрок будет забанен) и другие ситуации гриферского характера. (В том числе: сон на чужой кровати, гриф при помощи криперов, торговля с чужими жителями, фарм на чужих фермах, убийство чужих питомцев и скот и т.д без разрешения владельца).
**2.3** Запрещена порча окружающего мира, на не принадлежащей вам территории. (В том числе: строительство бессмысленных столбов, блоков и грязевых линий/мостов для своего передвижения, недорубка деревьев, создание кратеров при помощи криперов, уродование структурных генераций и т.д)
**2.4** Запрещено строительство и размещение города на чужой территории без договоренности с владельцем. Рекомендуемое расстояние для основания - 500 блоков от края близлежащего города. Каждый город имеет право на 500 блоков в каждую сторону от центрального портала.
**2.5** Запрещено строить механизмы, намеренно создающие нагрузку на сервер без какой-либо цели, в том числе загрузчики чанков. Фермы 0 тиков.
**2.6** Запрещено намеренное убийство игрока на чужой или мирной территории, а также присвоение личных вещей или уничтожение их.
**2.7** Запрещено использовать более 15 вагонеток на фермах в одном чанке, а также для убийства мобов.
**2.8** Запрещена АФК торговля в Хабе, на Ветках, на Спавне и в Энде .
**2.9** Запрещено нарушать правила поведения на общественных объектах, если таковые указаны строителями объекта.

**2.12** **Благотворители**.
**Благотворитель - 3 уровень**: Имеет право получить документы без срока годности.
**Благотворитель - 2 уровень**: Всё тоже что и 3 уровень, а также получать скидку в размере **"10"%** - **1** раз в месяц в **государственном** магазине.
**Благотворитель - 1 уровень**: Всё тоже что и 2 уровень, а также получают пенсию в размере **64** ара каждый месяц от **государства**."""

class CheatModsRules:
    title = 'Запрещенные модификации'
    description = """**3.1.Функция **EasyPlaceMode** в моде **Litematica** и подобные. Возможность любого автоматического строительства, разрушение блоков запрещена.
**3.2.** **Xaero's Minimap** и подобные им (функция **Player/mob radar**). Получение информации о местонахождении игроков или мобов посредством радара на миникарте запрещена. А также получение информации о пещерах и данжах.
**3.3.** Получение информации о **ХП** и иных характеристиках других игроков посредством модификаций - запрещено.
**3.4.** **Freecam**, **Chest Tracker**, **AutoSwitch**, **Inventory Totem** и любые их аналоги."""

class ServerInfo:
    title = 'Полезные команды'
    description = """**/roll** 1-6 кинуть кубики
**/me** - действие от 3-го лица
**/try** - действие от 3-го лица с исходом
**/sit** - сесть
**/lay** - лечь
**/ignore** - добавить/убрать игрока в игнор

**/itf toggle** – рамка, на которую смотрите станет прозрачной

На столе **кузнеца** "блок" + "череп визер скелета" = "мини блок"
На столе **кузнеца** "карта" + "сота" = "**некопируемая карта**"

**ПКМ**(правой кнопкой мыши) по столу лучника предметом в руке(кирка, меч, топор и т.д) и в другой руке держите **16** красителя. В информации предмета появится Ваша подпись.
Изменить и подделать подпись нельзя.

На сервере установлены кастомные ачивки.
Русификатор для ачивок: https://ptb.discord.com/channels/995379037407027270/995744032586215505/1008308487740198953

**Выключено** излечение зомби-жителя.
Торги с жителями в ценах Изумруды заменены на Изумрудные Блоки.
Починку можно поймать с помощью **рыбалки**.


Делитесь своими **Ресурспакоми** на сервере!
**/rp set** ссылка - устанавливает на ваш ник ссылку на ресурспак
Ссылка должна быть прямой (сразу скачивает архив)
**/rp load** ник - загружает ресурспак от игрока
Чтобы можно было загружать ресурспаки, поставьте в настройках сервера \"**Наборы ресурсов - Запрашивать или Включить**\""""

class DiscordRules:
    title = 'Правила Discord'
    description = """**1. Оскорбления / Токс / Причинение вреда**

**1.1.** Запрещено устраивать конфликты
**1.2.** Запрещено оскорблять участников Discord сервера.
**1.3.** Запрещено провоцировать на конфликт участников Discord сервера.
**1.4.** Запрещена травля и домогательства участников Discord сервера.
**1.5.** Запрещена умышленная клевета и нанесение серьезного репутационного ущерба.
**1.6.** Запрещено распространение дезинформации и введение в заблуждение участников Discord сервера.
**1.7.** Запрещено сливать конфиденциальную информацию участников Discord сервера.

**2. Запрещённая символика / Эротический контент / Политические стычки**

**2.1.** Запрещено любыми способами демонстрировать в Discord сервере Poop Land нацистскую символику и прочие похожие атрибуты. 
**2.2.** Запрещено любыми способами(кроме случаев, которые могут быть прописаны отдельно в правилах канала) демонстрировать эротический/ порнографический контент в Discord сервере Poop Land.
**2.3.** Запрещено разжигание ненависти / споров  на почве: национальности, вероисповедания, расы, пола, политических взглядов.


**3. Флуд / Пинг / Лазейки**

**3.1.** Запрещён флуд / спам / чрезмерный КАПС в Discord сервере Poop Land.
**3.2.** Запрещено отправлять в каналы / ветки сообщения не по теме.
**3.3.** Запрещен мешающий, беспричинный пинг глав / администрации проекта.
**3.4.** Запрещено пересылать любую информацию / идеи от замученного / забаненного игрока пока он является таковым. Исключением является информация с данного сервера, а также предоставление доказательств на суде."""

class NetherRules:
    title = '1. Правила нижнего мира'
    description = """1.1. Всё, что находится на территории центральных веток и хаба принадлежит государству.
1.2. ХП - далее хайперлупа, ветка игрока.

**2.Правила размещения ХП и порталов:**

2.1. Портал должен находиться минимум в 20 блоках от центра государственной ветки.(почвы душ по центру);
2.2. ХП может быть в любом стиле если не задевает территорию государственной ветки;
2.3. В случае если ХП задевает территорию государственной ветки, необходимо оформить выделяющуюся часть под стиль ветки,
на которой она размещена. (Красная, синяя, зелёная, жёлтая);
2.4. В случае, если портал/ХП обустроены не по правилам и после предупреждения не был переделан, то работники ада имеют право снести его.
2.5. Каждый портал/ХП обязан быть помечен: владелец и, желательно, что это за территория. Опознавательный знак может быть в виде таблички с подписью или флага. Опознавательный знак должен стоять у самого портала или у самого начала ХП (желательно).
2.6. В случае отсутствия опознавательного знака или записи о регистрации территории в дискорде, и после предупреждения не было предпринято никаких действий, то работники ада имеют право снести ХП/портал.
"""

class SpawnRules:
    title = 'Правила рекламы на спавне:'
    description = """Территория спавна - это область 500 на 500 блоков любую из сторон, блоки, шалкера, ресурсы в сундуках , которые были оставлены на территории спавна, принадлежат территории спавна

**Правила размещения агитационных плакатов перед/до выборов:**

**1)** Разрешается повесить от одного до пяти агитационных плакатов на спавне.
**2)** Запрещается использовать ненормативную лексику на агитационных плакатах.
**3)** Запрещается указывать личную информацию на агитационных плакатах.
**4)** Запрещается дискредитировать других кандидатов на своих плакатах.
**5)** Запрещается собственноручно размещать агитационные плакаты на спавне без ведома Главы спавна и/или же Зам.Главы спавна.
**6)** Запрещается собственноручно сносить агитационные плакаты других кандидатов на спавне.

Стоимость размещения агитационных плакатов на спавне составляет 16 ар в неделю за одну часть карты.

**Правила размещения рекламы телеграмм-каналов/остальных соц.сетей:**

**1)** Разрешается повесить от одного до пяти плакатов на спавне.
**2)** Запрещается собственноручно размещать плакаты на спавне без ведома Главы спавна и/или же Зам.Главы спавна.
**3)** Запрещается собственноручно сносить плакаты других людей на спавне.
**4)** Запрещена реклама сторонних ресурсов помимо нашего сервера PoopLand.

Стоимость размещения рекламы на спавне: 32 ара в неделю за одну часть карты.

**Правила размещения рекламы городов на спавне:**

**1)** Разрешается повесить от одного до пяти плакатов на спавне.
**2)** Запрещается собственноручно размещать плакаты на спавне без ведома Главы спавна и/или же Зам.Главы спавна.
**3)** Запрещается собственноручно сносить плакаты других городов на спавне.
**4)** Запрещается использовать ненормативную лексику на плакате.
**5)** Запрещается дискредитировать другие города.

Стоимость размещения рекламы города на спавне: Бесплатная, с учетом вышеперечисленных правил."""

class FarmRules:
    title = 'Правила Ферм'
    description = """Городам **запрещено** пользоваться **БОЛЬШИМИ ФЕРМАМИ**
При онлайне игроков **50** человек и выше.

Все фермы должны находится на территории города. Исключением являются фермы, которые строятся в определенных биомах (ведьмы, гварды, ферма обсидиана и т.д)
Запрещено менять тип **БОЛЬШОЙ ФЕРМЫ** более чем раз в 1 месяц, если вы снесли старую ферму. И раз в два месяца, если вы не сносили старую ферму.
При смене типа фермы нужно сносить ферму **полностью**.
Поселениям менее 8 человек (базам, деревням, сообществам и т.д). Запрещено располагать **ДЕФОЛТНЫЕ ФЕРМЫ(однотипные)** ближе чем 100 блоков.
Запрещены строить фермы, нарушающие экономику сервера.
Суд будет определять нарушает ли данная ферма экономику.

Чтобы пользоваться **БОЛЬШОЙ ФЕРМОЙ** нужно:
Зарегистрировать свой город в **Дискорде** и указать на сайте не менее 8 жителей с одним гражданством. Жители с двойным гражданством могут пользоваться **БОЛЬШОЙ ФЕРМОЙ** города в котором они числятся на сайте.
В случае нарушения этого правила, будет выставлен инвойс на 5 ст. АР./бана за неуплату или повторное нарушение.

Союзным городам **СТРОГО ЗАПРЕЩЕНО** передавать ресурсы с ферм на бесплатной основе, а также давать доступ к фермам жителям союзного города для добычи ресурсов. Цена при продаже между городами должна соответствовать рыночной цене.

**ДЕФОЛТНЫЕ ФЕРМЫ:**
Дефолтные фермы - маленькие фермы, которых в городе может быть по одной каждой.
**1. Фермы еды**
Пшеница/морковь/свекла/картошка (все это на одном жителе), тыквы/арбузы 2 ряда (16 первый ряд, 16 второй ряд), ламинарии/тростник/бамбук 2 ряда (16 первый ряд, 16 второй ряд), кактусы (один чанк и высотой один ряд).
**2. Фермы мобов**
Коровы/овцы/свиньи/лошади и все другие мобы (максимум 10 штук), ферма слизней/магмовых кубов (один чанк), спавнеры (максимум 3 на город), ферма железа (максимум 3 жителя), жители (максимум 10 штук), пчелы (максимум 30 штук).
P.S Все фермы, связанные с жителями, входят в число 10 жителей.
**3. Фермы блоков**
Обсидиан, цветы, деревья, грязь и др. должны работать только при нахождении человека на ферме. Если человека на ферме нет, то она должна быть в выключенном состоянии.
**БОЛЬШИЕ ФЕРМЫ:**
**Большие фермы** - фермы, которые выбирает город в канале <#1000091104118591608>. Такая ферма может быть одна на весь город. **Большие фермы** должны иметь хорошую сортировку, мобы должны не скапливаться. Также ваша ферма не должна нагружать сервер. Если из этих пунктов вы что-либо нарушили, сначала предупреждение, потом штраф (5 ст. АР), вплоть до бана.

Ферма золота (три этажа максимум), ферма железа (больше трех жителей, но не более 30 штук), ферма трейдов на пиглинах (более 10 пиглинов), ферма гвардов, ферма пороха, ферма жителей(не более 30 штук), ферма гастов, ферма хоглинов, ферма рейдов (тотемов), ферма любых животных (больше 10 штук).

**ЗАПРЕЩЕННЫЕ ФЕРМЫ:**

Ферма трезубцев, ферма визер скелетов, более 3 спавнеров в зоне прогрузки на ферме.

Запрещено иметь более 1 шалкера в зоне прогрузки"""

class EndRules:
    title = 'Правила Энда'
    description = """Свод правил об обеспечении правопорядка в Энде
	Часть территории Энда и правопорядок на ней охраняется законом.

Статья 1. Терминология 
1. Центральный остров - остров в Энде, на котором спавнится Эндердракон.
2. Центральный портал - портал в Энде, на вершине которого спавнится яйцо Эндердракона, состоящий из портальных рамок и блоков бедрока.
3. Центральный маяк - маяк, установленный в центре Центрального острова, под центральным блоком Центрального портала.
4. Капсулы на центральном острове (далее Капсулы) - 20 не восстанавливающихся порталов в разные точки Энда, располагающиеся на Центральном острове, состоящие из портальных рамок и блоков  бедрока и парных к ним порталов, располагающиеся в разных точках Энда, состоящие из портальных рамок и бедрока.

Статья 2. Общий порядок обеспечения правопорядка
1. Правопорядок в Энде обеспечивают Глава энда и Следящие  энда.
2. Глава энда и Следящие энда могут выписывать инвойсы игрокам по основаниям, указанным в настоящем своде правил.
3. Положения, указанные в настоящем своде правил, действуют только на территории Центрального острова и на иных территориях в Энде, если это предусмотрено настоящим сводом правил.
4. В случае проникновения игрока на запретку Энда и осуществления хищения ресурсов Энда, хранимых на запретке Энда, Следящие  энда и Глава энда имеют право убить игрока, осуществляющего таковое хищение и обязуются вернуть ему его личные вещи. 
5. Запретка Энда может устанавливаться только Главой энда.
6. Любые инвойсы, выданные на основании настоящего свода правил, могут быть оспорены в Суде.

Статья 3. Границы территории центрального острова в Энде 
1. Территория Центрального острова составляет 400х400 от Центрального портала.

Статья 4. Действие положений настоящего Свода правил на прочих территориях в Энде
1. Положения настоящего Свода правил также действуют на территориях в Энде, на которые ведут Капсулы, признанные государственными.  
2. Территория в энде, на которую ведёт Капсула составляет  400х400 от блока портала парной Капсулы от Капсулы на Центральном острове, признанной государственной и ведущей на данную  территорию.
3. Положения настоящего Свода правил также действуют на территории государственных ферм в Энде. Перечень и координаты государственных ферм находится у Главы энда.

Статья 5. Капсулы
1. Запрещено ломать любую из 20-ти Капсул - бан.


**Штрафы:**

1. Запрещено оставление дракона в живых в течение более 15-ти минут после его спавна - штраф 64 АР
2. Запрещено спавнить дракона во время проведения мероприятия, а также в течение 15 минут после окончания мероприятия - штраф 64 АР.
3. Запрещен спавн дракона  при 8 ТПС и ниже - штраф 128 АР.
4. Запрещен спавн дракона без согласия Главы Энда или ответственного лица - штраф 64 АР и восстановление сломанных драконом блоков.
5. Запрещено ломать Центральный портал - штраф 16 АР за один блок.
6. Запрещено ломать любую из 20-ти Капсул - бан.
7. Запрещено использовать территорию Центрального острова и территории, на которые ведут Капсулы на Центральном острове, признанные государственными, для своих нужд без согласования с Главой  энда, а именно:
 1) Запрещено длительное (более 16 минут) хранение и использование каких-либо ресурсов для своих нужд без согласования с Главой энда - штраф 64 АР.
 2) Запрещена постройка каких-либо сооружений без согласования с Главой энда - штраф от 16 до 512 АР в зависимости от размера сооружения + 4 АР за каждый поставленный  блок.
8. Запрещено занимать Капсулы без согласования с главой Энда - штраф  64  АР. В случае, если игрок, самовольно занявший Капсулу на Центральном острове без согласования с Главой энда, не уберёт личные постройки и(или) не заберёт личные вещи с территории, на  которую ведёт данная Капсула в течение 24 часов с момента требования от Главы энда, то будет получать штраф в 16 АР за каждый час сверх данных 24 часов.
9. Запрещено ломать Центральный маяк - штраф 128 АР.
"""

class PoliceDeportamentRules:
    title = 'Правила ПД'
    description = """**ПД** - обязаны носить с собой своё **удостоверение** с актуальными данными и верной **датой** срока годности. Предъявлять свое удостоверение на просьбу игрока. В ином случае игрок имеет право не подчиняться просьбам и приказам *ПД*.
2)Каждый **игрок** должен при себе иметь свой **паспорт** с актуальными данными и верной **датой** срока годности. И в случае просьбы сотрудника **ПД** предъявить его для проверки. Если паспорт игрока просрочен, то **ПД** в первый раз вынесет предупреждение, а во второй раз будет наложен штраф "16 ар"."""

class NalogRule:
    title = 'Налоги страны PoopLand'
    description = """Каждый афк-бизнес должен быть зарегистрирован в паспортном столе. Стоимость одноразовой регистрации обычного афк-бизнеса составляет 3 ар за каждую торговую "бочку". 

Регистрация всех остальных видов афк-торговли - 32 ар.
Лицензия на торговлю действовует 1.5 месяца.
Штраф за незарегистрированный магазин/другой вид афк-торговли - 256 ар."""
class MZRules:
    title = "Правила МинЗдрава:"
    description = """Запрещено ношение брони в больницах (кроме обуви и элитр);

Запрещена музыка, выкрики, использование саундпада, если это мешает и/или не разрешено медицинскими сотрудниками, которые находятся на смене на данный момент времени;

Запрещено вести себя неподобающим образом (курить, пить алкоголь и т.п.);

Запрещена торговля медикаментами и препаратами, которые не были утверждены Минздравом;

Запрещено срывать уже идущее рп сотрудникам МЗ;

Медицинские услуги могут оказывать сотрудники МЗ или же сотрудники аккредитированной Главой МЗ организацией.

**Требования к размещению больниц в городах:**

    Если вы хотите разместить больницу в своем городе, вам необходимо соблюсти несколько условий для комфортной работы медицинских работников.

**1.** В помещении должны находиться: регистратура (например, небольшой столик при входе для приема и записи пациентов), общие палаты (для госпитализации пациентов), туалетная комната, несколько обычных кабинетов (в которых есть стол врача, стулья для пациентов, койка для осмотра, по возможности иное оборудование в зависимости от профиля врача, книжные полки и бочки для хранения лекарств) и операционная (хирургический кабинет). + месторасположение (необходимы указатели для того, чтобы у игроков была возможность без проблем добираться до пункта назначения).

**2.** Если в вашем городе есть открытый лор (при котором гос. организации не оказывают никакого влияния на городское рп), то вы должны быть готовы принять Минздрав с их условиями работы в пункте 1 или найти компромисс, ограничившись лишь несколькими пунктами.

**3.** Если в вашем городе есть закрытый лор (при котором вы не можете пойти на уступки государству и ничего изменить в своих помещениях), то Минздрав не будет работать в полной мере. В таком случае ваше помещение либо уйдет в резерв, либо будет использоваться только при ваших городских ивентах, заранее обговоренных с действующим главой Минздрава.

**Требования к размещению аптек в городах:**
Если вы хотите разместить аптеку в своем городе, вам необходимо соблюсти условия для комфортной работы фармацевтов.

Это может быть небольшое помещение, пристройка, в которой есть место для товаров (бочки), а также прилавок, за которым будет стоять аптекарь. + желательно около больницы. Если больницы в городе нет, то необходимы указатели до аптеки."""

class TerritoriesRules:
    title = 'Правила Территорий'
    description = """**Запретки**
    
Правила о запретных территориях связаны с тремя типами: государственными, городскими и личными. 
Запретная территория, также известная как запретка, представляет собой определенную область, отмеченную табличками, доступ к которой разрешен только определенным лицам. 
Для зданий также действуют те же правила, что и для территорий.
Государственные запретки могут быть посещены ТОЛЬКО с разрешения <@799720430603599882> или <@284748335783477249>. Или в отдельных случаях с разрешения глав, чьи являются эти запретки.
Городские запретки доступны ТОЛЬКО жителям, указанным в списке городских жителей на сайте и так же имеют разрешения Мэра города. 
Личные запретки могут посещать ТОЛЬКО лица, получившие разрешение от владельца запретки. 
Нарушение правил влечет штраф в размере 16 АР за каждое нажатие на дверь, калитку или кнопку, а также штраф в размере 64 АР за проникновение на территорию. Так же штраф за проникновение может быть увеличен по решению суда.
Однако Олежка и Соня имеют право заходить на ЛЮБУЮ запретную территорию в случае необходимости. И давать разрешения на заход сотрудникам ПД

**Чёрный список**

Правила о Черных списках (далее ЧС) связаны с двумя типами: городскими и организационными. 
ЧС представляют собой запрет на вход на территорию города или в здание организации.
Городское ЧС предусматривает полный запрет на вход на территорию города. Однако есть исключения, такие как Суд в городе или во время ивента, с разрешения организатора этого мероприятия.
ЧС организаций влечет полный запрет на вход в здание организации без каких-либо исключений, только если владелец не уберёт вас
Оформление ЧС осуществляется с помощью кафедры с книгой (или таблички), установленной у входа в город (в верхнем мире и в аду) или здание.
За нарушение правил ЧС предусмотрен штраф в размере 64 АР. Суд может увеличить штраф в зависимости от обстоятельств.
Книгу с кафедры может взять только Мэр города или владелец организации.
Если любой другой игрок попытается взять книгу, ему будет назначен штраф в размере 16 АР, независимо от наличия каких-либо изменений."""


class InvoiceRules:
    title = 'Штрафы PoopLand'
    description = """1. За вход в государственную запретку штраф 32 ар.
 1. За нажатие кнопки/плиты/калитки на гос.запретку штраф 8 ар(если вы докажете случайное нажатие, тогда штрафа не будет).
 2. За вход в коридор хранилища банка штраф 64 ар.
 3. За вход в хранилище банка штраф 256 ар.
 4. За нарушение правил ЧС(правила территорий) предусмотрен штраф в размере 32 АР. Суд может увеличить штраф в зависимости от обстоятельств. Книгу с кафедры может взять только Мэр города или владелец организации. Если любой другой игрок попытается взять книгу, ему будет назначен штраф в размере 8 АР, независимо от наличия каких-либо изменений.
 5. Штраф за вход на запретную территорию игроков не может быть выше 64 ар. За вход в запретные здания игроков-192 ар.
 6. За каждый украденный предмет на гос.запретках штраф 5 ар.
 7. За воровство ценных предметов(книги,арты, маяки, звезды незера, броня, оружие, инструменты) штраф 16 ар.

2. За пвп в общественных местах(хаб, ветки,гл.остров энда, спавн, здания пд,мз,пс) штраф 16 ар.
 1. За убийство игрока в общественных местах, которые перечислены выше, штраф 32 ар.

3. После второй жалобы на провокацию межнационального конфликта(правило 1.1.1.) предусмотрен штраф 256 ар.

4. За любое проявление токсичного поведения по отношению к игрокам, городам, а также всему проекту в целом будет выдан штраф в размере 128 ар.

5. За нарушения агитационного молчания во время выборов(правило 1.9) предусмотрен штраф 512 ар. В отдельных случаях может рассматриваться вопрос снятия кандидата с выборов.

6. Неуважительное отношение/избиение/помехи в работе государственного работника наказуемы штрафом 16 ар. В отдельных случаях главы могут вносить игроков в черные списки и отказывать в обслуживании.
 1. За ложный вызов государственного работника предусмотрен штраф 5 ар.
 2. За ношение формы государственных работников игроками, которые не состоят в структуре, предусмотрен штраф 16 ар(в случаях рп(решает глава) не применяется).
 3. Штраф на любого рода дискредитацию ПД в глобальном/локальном чате/голосовом чате. Штраф - 16 ар.

7. За сломанный/измененный/установленый блок на государственных территориях(хаб,спавн,гл.остров энда, ветки, здания пд,мз,пс) штраф 4 ар(по решению главы).
 1. За установку/поломку/изменения светящиеся табличек штраф 4 ар.
 2. За установку/использование кровати на государственной территории(кроме верхнего мира) штраф 64 ар.
 3. За установку/использование маяка возрождения на государственной территории (кроме ада) штраф 64 ар.
 4. За установку кристалла/тнт на государственной территории штраф 64 ар(за тнт в отдельных случаях не применяется).

8. Штраф за использование рекламного щита без разрешения арендодателя 10 аров за рамку.

9. Штраф за поломку блока/рамки/карты рекламного щита 16 аров.

10. Государственные штрафы суммой до 192 ар. должны быть оплачены спустя неделю с момента выдачи. Гос.штрафы выше 192 ар. должны быть оплачены спустя 2 недели. В случае неуплаты штрафа, он удваивается и время на выплату остаетя таким же. В случае повторной неуплаты игрок будет забанен.

11. Запрещен спам лодок (от 6 лодок одновременно в течении часа) штраф 16 ар.

12. Запрещено массовое хищение лодок (от 6 и более за час), имея прямой умысел навредить работе хаба. Штраф от 16 ар.
 1. Запрещено брать с бочек выдачи гос. газет более 2 единиц. За каждую следующую газету будет выдан штраф 2 ар.

13. Запрещено умышленно создавать помехи движению лодок в хабе и на ветках. Штраф 8 ар.

14. За отсутствие/несоответствие и просроченность паспорта штраф 10Ар

15. При повторном нарушении правила, ваш штраф будет увеличиваться в 2 раза, а также будут учитываться предыдущие штрафы. Администрация и Главы имеют право не увеличивать штраф при его выдаче.
"""

class BanRules:
    title = 'О банах на проекте:'
    desciption = """**1.** Если вы были забанены на сервере и заходите с другого аккаунта, тогда ваши все аккаунты будут забанены перманентно.
**1.1.** Если вы не предупредили администрацию о наличии двох и более аккаунтов, тогда ваш аккаунт, который был замечен в игре будет забанен на 3 месяца.
**2.** За использование Иксрея вы будете забанены до конца сезона, если до него больше 1.5 года. Если меньше, тогда вы должны будете просить в бане 1.5 года.
**3.** За не жесткие читы предусмотрен штраф 1200 ар либо бан на 1.5 месяца по вашему желанию.
**4.** За жесткие читы предусмотрен перманентный бан.
**5.** За гриф/попытку грифа предусмотрен бан до суда. Если гриф был совершен на запретках игроков, складах, ветках,в хабе, на главном острове энда, на спавне, в зданиях гос.структур, тогда вы будете забанены до конца сезона, если до него больше 1.5 года. Если до конца сезона меньше 1.5 года, тогда вы должны будете досидеть этот срок.
**6.** За воровство более 600 ресурсов предусмотрен бан до суда.
**7.** За неуплату штрафа предусмотрен бан до выплаты. Если возможности выплатить штраф нет, тогда вы подаете дело в суд на разбан с просьбой о дополнительном времени для выплаты, либо замены штрафа на отработки.
**8.** За порчу экономики, токс, забивы и тд. бан может быть только по суду.
**9.** Вы можете получить бан по решению администрации в случае, если ваши действия несут диструктивный характер."""

class TradeRules:
    title = 'Правила торговли'
    description = """1. **Запрещена** **АФК** торговля в переделах **Спавна, Хаба, Энда и Веток**.
2. **Запрещено** делать порталы на ветках, ведущие в магазины, пункты выдачи и подобные сооружения. А также дорожка из портала не должна вести в зону торговли. В спорных вопросах решение за **Администрацией** сервера.
3. Торговать **АФК** вы можете в своих городах и на своих базах. **"Магазин"** должен находиться минимум в **50** блоках от портала.
4. **Не АФК** торговлей (**РП торговля**) считается торговля, когда игрок на протяжении всего времени находится в зоне торговой точки (палатка, стойка и т.д) и **взаимодействует** с игроками (выдаёт товар и получает оплату).
5. При получении разрешения у **глав** (**Спавна, Хаба, Энда**) вы можете **временно** установить (арендовать) торговую точку для проведении **РП торговли**."""

class DashBoardCourtRules:
    title = 'Правила Суда'
    description = """📜 **Как подать дело в суд?** - Пункт где прописан гайд по подаче дел в суд

⚖️ **Правила суда** - Пункт, с основными правилами суда

💼 **Писари и присяжные** - Пункт, в котором прописаны права судебеных писарей

⚖️ **Права судейства и участников суда** - Пункт, в котором прописаны права состава судейства

📨 **Неявки** - Пункт, в котором прописаны санкции применяемые к ответчику за неявку на суд

:coin: **Издержки** - Пункт, в котором прописано понятие издержи и её минимальная сумма

💼 **Адвокаты и Прокуроры** - Пункт, в котором прописаны права и обязанности адвокатов и прокуроров, а также их полномочия

⚖️ **РП суды** - Пункт, в котором описана информация о РП судах

💵 **Штрафы Суд** - Пункт, в котором прописаны штрафы судейства"""

class HowFileLawsuit:
    title = '📜Как подать дело в суд?📜'
    desciption = """Суды проходят в субботу в **19:00** по МСК.

**▫️** Дело в суд можно подать на сайте:
Для подачи дела в суд следует перейти в соответствующий раздел на сайте [SPworlds](https://spworlds.ru/pl/lawsuits), сделать это можно, нажав на заголовок данного раздела. Для подачи дела нажмите кнопку [[+ Подать дело]](https://spworlds.ru/pl/lawsuits/new)
===============================================================================================

ОБЯЗАТЕЛЬНО:

Укажите требования и прикрепите пруфы на сайте
Если у вас есть адвокат - напишите это в деле ник и его мысли

===============================================================================================

Как правильно заполнить дело на сайте:

1️⃣Заголовок: (В этой строке напишите о чем ваше дело)
2️⃣На кого дело?: (Выбераете игрока, на которого вы подаете в суд)
3️⃣Описание: (Опишите все подробности дела обязательно добавив доказательства и требования)

(Если дело не будет описано подробно, оно будет скипнуто)

После подачи дела ожидайте решения судьи, после решения дела вам придёт уведомление на сайте, где вы можете узнать вердикт. В случае если вы не согласны с вердиктом судьи, вы можете подать аппеляцию на это дело, указав что это аппеляция на такое-то дело в новом деле.

===============================================================================================
📄Шаблон для сайта:📄

РП с кристаллами
Mamkin_Ugodnik
Зашёл на запретку моей базы, начал бегать и расставлять кристаллы везде, но не взорвал. Требую штраф стак ар. (СКРИНЫ)"""

class CourtRules:
    title = '⚖️ Правила Суда'
    description = """**5.1** Сотрудник Полицейского депортамента имеет право убить игрока на суде по решению Судьи, ведущего дело, если игрок мешает вести Суд и предупрежден о недопустимости своего поведения Судьёй, ведущем дело, более 3-ех раз.

**5.2** Подающий или отвечающий имеют право отстранить присяжного от рассмотрения дела, если по их мнению он предвзят к той или иной стороне дела.

**5.4** Судья вправе отсранить присяжного от рассмотрения дела, если по его мнению он предвзят к той или иной стороне дела.

**5.5** Окончательное решение за оставлением или отстранением присяжного остаëтся за Судьëй, ведущем дело.

**5.6** Игроки, подающие дело на разбан в обязательном порядке должны присутствовать на суде (в дискорде как минимум).

**5.7** В случае, если Вы находитесь в перманентном бане (пермаче) и хотите подать апелляцию на свой разбан, то срок, через который вы можете подать апелляцию с момента начала бана, составляет 1,5 (полтора) года.

**5.8** При вынесении вердикта суд может учитывать моральные нормы и прецедентное право.

**5.9** Срок исполнения решения Суда для истца и(или) ответчика по умолчанию составляет 1 неделю и может измениться по решению Судьи.

**5.10** При рецидиве нарушения правил наказание за новые нарушения может быть дополнительно ужесточено по усмотрению Судьи, ведущего дело, в связи с самим фактом рецидива.

**5.11** Если дело на бан или разбан. Состав присяжных должен быть от 5 до 7 присяжных."""

class ClerksAndJurors:
    title = '💼 Писари и присяжные'
    description = """__**Писарь**__ - сотрудник судейства, ведущий протоколирование судебного заседания.

Писарь имеет право заходить в канал к присяжным и слушать, как они выносят вердикт по делу, чтобы выявить, предвзят кто-то из них к одной стороне дела или нет. В случае появления подозрений в предвзятости писарь обязан сообщить о своих соображениях Верховному судье или Судье, ведущему дело.

Писарь не имеет права вмешиваться в обсуждение вердикта по делу присяжными. В случае, если он это делает, присяжные имеют право сообщить об этом Верховному судье или Судье, ведущему дело. 

Писарь и любой из присяжных не вправе разглашать содержание разговора присяжных. В случае свершения данного инцидента, писарь и/или присяжный будут моментально наказаны в соответствии с правилами PL.

__**Присяжный**__ - игрок PL, участвующий в вынесении вердикта по судебному делу.

Присяжные набираются Судьёй, ведущим дело. 
"""

class RightsCourt:
    title = '⚖️ Права судейства у участников суда'
    description = """> **🧸 Верховный судья и Заместитель верховного судьи:**
**・** Верховный судья и Заместитель верховного судьи контролируют работу судебной системы и несут ответственность за ошибки всего судейства.
**・** Ведут набор в судьи и(или) писари, при нехватке сотрудников.
**・** Увольняют судей или писарей, если есть на то причины.
**・** Обучают новичков в судействе или назначают ответственного за это человека.
**・** Составляют список городов, в которых проводятся суды, и осуществляет контроль над очередностью проведения судов.
**・** Верховный судья разрешает все вопросы по судейству с админами, правительством и игроками

> **🧑‍⚖️ Судьи:**
**・** Ведение суда.
**・** Изменение решения присяжных.
**・** Набор присяжных для рассмотрения дела.
**・** Может помогать писарю во время суда.
**・** Имеют право выдать штраф за некорректное поведение на суде в сооветсвии с правилами PL.
**・** Имеет право заходить в закрытые каналы для того, чтобы вызвать подающего, отвечаюещго и(или) свидетелей.

> **👩‍⚖️ Писари:**
**・** Должен записывать дела и результаты судов.
**・** Оповещение в обьявления о начале суда.
**・** Имеет право выдавать мут человеку на суде, если на то есть повод.
**・** Заходить в канал присяжных во время суда, чтобы следить за тем, предвзяты ли они.
**・** Помогать судье во время суда.
**・** Писарь может скипнуть дело до суда по основаниям, указанным в правилах PL.
**・** Должен выдавать инвойсы.
**・** Обязан уведомлять Верховного судью или Судью, ведущего дело, о наличии предвзятости у присяжного(ых)."""

class Absences:
    title = '📨 Неявки'
    description = """・В случае, если если у подающего или ответчика есть уважительная причина, из-за которой они не могут явиться на суд, рассмотрение их дела может быть однократно перенесено на следующий суд без зачёта неявки по просьбе подающего и ответчика. (И подающий и отвечающий имеют однократное право переноса дела.)
(Уважительной причиной считается предупреждение верховного судьи/судьи или писаря за 24 часов до суда).
・1 неявка - 16 АР
・2 неявка - 32 АР
・3 неявка - 48 АР и скип дела, если 3 неявки у подающего или решение дела без ответчика, если 3 неявки у отвечающего, так же издержка назначается отвечающему."""

class Costs:
    title = '🪙 Издержки'
    description = """__**Издержка**__ - затраты, понесённые участниками судебного процесса, в связи с рассмотрением и разрешением их судебного дела. Издержка идёт в Казну судейства и тратится на зарплаты для судейского состава. 

**・**Срок выплаты издержки 1 неделя.
**・**Минимальная издержка за дело 16 АР.
**・**Судья решает сумму издержки и то кому она будет выставлена."""

class Penalties:
    title = '🪙 Штрафы'
    description = """**・** Нарушение правил на суде - 24 АР
**・** Ношение брони на суде - 24 АР
**・** Спам в глобал чат во время суда - 48 АР
**・** Езда во время суда на лодке и т.п. - 24 АР
**・** Оскорбления игрока - 64 АР
**・** Оскорбления судейского состава - 256 АР
**・** Снос тотема/Убийство - 128 АР + Суд
**・** Разглашение разговора присяжных одним из присяжных - 256 АР + Суд
**・** Разглашение приговора присяжных писарем - наказание определяется Верховным судьёй индивидуально.
**・** Штрафы за дела "пустышки" - 48 АР

! Дела "пустышки" - глупые дела по типу "он не дал мне 10000 АР просто так" или дела не подкрепленные какими-либо доказательствами.
! Если один игрок в течение 1 суда оскорбил кого-то более 3-ех раз - БАН.
! Срок уплаты штрафа - 1 неделя, в случае неуплаты штрафа размер штрафа удваивается и даётся ещё 1 неделя на его выплату. В случае невыплаты штрафа в течение недели после его удвоения, игроку даётся ещё 3 дня на его выплату, если он его не выплатит и за эти 3 дня, то он банится до уплаты штрафа посредством сайта PL. (Штраф также может быть оплачен друзьями)"""

class LawyersAndProsecutors:
    title = 'Адвокаты и Прокуроры'
    description = """> **Адвокатура:**
**1.** Адвокат не имеет права разглашать разговор/детали и т. п. с подзащитным без его согласия.
**2.** Адвокату КАТЕГОРИЧЕСКИ запрещается гарантировать успех или провал дела.
**3.** Адвокат обязан добиваться смягчения вердикта или вовсе оправдания (Это не означает, что он обязательно должен быть)
**4.** Адвокат обязан использовать любые средства, которые не нарушают правила сервера, для защиты подсудимого. 
**5.** Адвокат является голосом подзащитного и адвокат полностью несет ответственность за сказанное. (Вы имеете право написать жалобу на адвоката, если будет доказано то, что он сказал что-то лишнее)
**6.** Адвокат является бесплатным и не имеет право требовать АРы с подзащитного (Но вы можете дать ему на чай за хорошую работу)
**7.** Когда адвокат берет дело, он автоматически соглашается с тем, что не будете предвзятым к подзащитному не взирая на разногласия, ссоры, недопонимания.
**8.** Подзащитный обязан предоставить всю имеющуюся информацию касательно дела, которое адвокат будет представлять на суде
**9.** Если Адвокат взял дело, то он обязан на него явится (кроме исключений)

Деятельность частных адвокатов разделом правил "Государственные адвокатура и прокуратура" не регулируется, но она должна соответствовать остальным правилам проекта PL.

> **Прокуратура:**

__**Прокуратура**__ - орган государственной власти, целью которого является представление интересов государства в Суде и контроль за уплатой штрафов.

Прокурор имеет следующие права и обязанности:
**1.** Представление в Суде стороны Ответчика в Делах на бан или разбан.
**2.** Контролирование уплаты штрафов, их удвоения.
**3.** Уведомление граждан PL о наличии у них штрафов, о их удвоении и истечении срока выплаты штрафа(когда даются финальные 3 дня на выплату штрафа)."""

class RolePlayCourt:
    title = 'РП суды'
    description = """1. Подающий должен договориться с ответчиком о РП суде
1.1. Подающий и ответчик должны заранее подготовить историю своего РП дела. (то есть дать полное описание своей истории).
1.2 Подающий и ответчик должный подготовить доказательства против друг друга.
1.3 У подающего и ответчика должны быть при себе улики/материалы дела непосредственно на сервере в майнкрафта, свидетели. Иные доказательства не рассматриваются. 
2. Неявка на РП суд без предупреждения за 24 до суда - 60АР
3. Решением РП суда могут быть назначены исправительные работы, срок в тюрьме, моральная компенсация, посмертная казнь и т. п.
4. Использование информации из реального мира при отыгровке РП - во время РП суда запрещены
5. Решение на РП суде принимается судьей и судебным писарем
5.1 Издержки за РП дело - от 16 до 64 ар.
6. Дело отклоняется если кто-то из его участников не согласен в нем участвовать.
7. Подавая дело в нем обязательно должна быть пометка [РП]."""

    
